[
  "Why don’t scientists trust atoms? Because they make up everything.",
  "I told my computer I needed a break, and it said ‘No problem — I’ll go to sleep.’",
  "Why did the scarecrow win an award? Because he was outstanding in his field.",
  "I would tell you a construction joke, but I’m still working on it.",
  "Why don’t skeletons fight each other? They don’t have the guts.",
  "Did you hear about the mathematician who’s afraid of negative numbers? He will stop at nothing to avoid them.",
  "Why did the bicycle fall over? It was two tired.",
  "Parallel lines have so much in common. It’s a shame they’ll never meet.",
  "I told my wife she was drawing her eyebrows too high. She looked surprised.",
  "I threw a boomerang a few years ago. I now live in constant fear.",
  "Why did the coffee file a police report? It got mugged.",
  "I’m reading a book about anti-gravity. It’s impossible to put down.",
  "What did the buffalo say when his son left for college? Bison.",
  "Why don’t programmers like nature? It has too many bugs.",
  "What do you call fake spaghetti? An impasta.",
  "Why did the tomato turn red? It saw the salad dressing.",
  "I used to play piano by ear, but now I use my hands.",
  "Why did the golfer bring two pairs of pants? In case he got a hole in one.",
  "I told a joke about chemistry, but there was no reaction.",
  "Why do cows have hooves instead of feet? Because they lactose.",
  "What do you call cheese that isn’t yours? Nacho cheese.",
  "Why couldn’t the leopard play hide and seek? Because he was always spotted.",
  "I’m on a seafood diet. I see food and I eat it.",
  "Why did the cookie go to the doctor? Because it felt crumby.",
  "I would tell you a joke about pizza, but it’s too cheesy.",
  "How does a penguin build its house? Igloos it together.",
  "What did one ocean say to the other? Nothing, they just waved.",
  "Why did the math book look sad? It had too many problems.",
  "What do you call a belt made of watches? A waist of time.",
  "Did you hear about the restaurant on the moon? Great food, no atmosphere.",
  "Why did the chicken go to the séance? To talk to the other side.",
  "I’m reading a book about teleportation. It’s bound to get somewhere.",
  "What do you call a dinosaur with an extensive vocabulary? A thesaurus.",
  "Why don’t eggs tell jokes? They’d crack each other up.",
  "I used to be a baker, but I couldn’t make enough dough.",
  "How do you organize a space party? You planet.",
  "Why did the banana go to the doctor? It wasn’t peeling well.",
  "I once got fired from a canned food factory. Apparently I couldn’t keep my lids on.",
  "Why don’t some couples go to the gym? Because some relationships don’t work out.",
  "What did one plate say to the other? Dinner’s on me.",
  "I’m on a whiskey diet. I’ve lost three days already.",
  "Why did the scarecrow become a successful neurosurgeon? He was outstanding in his field and also studied hard.",
  "I told my cat to get a job. It’s a purrmanent position now.",
  "Why did the duck get a makeover? It had too many quacks.",
  "I used to be afraid of hurdles, but I got over it.",
  "Why did the skeleton cross the road? To get to the body shop.",
  "What do you call an elephant that doesn’t matter? An irrelephant.",
  "Why was the computer cold? It left its Windows open.",
  "I bought some shoes from a drug dealer. I don’t know what he laced them with, but I’ve been tripping all day.",
  "Why did the picture go to jail? Because it was framed.",
  "I was going to tell a joke about time travel, but you didn’t like it.",
  "Why was the math teacher late? She took the rhombus.",
  "What did the zero say to the eight? Nice belt!",
  "I asked the librarian if the library had books on paranoia. She whispered, ‘They’re right behind you.’",
  "Why did the cookie cry? Because its mom was a wafer too long.",
  "I used to be a banker, but I lost interest.",
  "Why do bees have sticky hair? Because they use a honeycomb.",
  "I’m reading a book on the history of glue. I can’t seem to put it down.",
  "Why don’t oysters share their pearls? Because they’re shellfish.",
  "What do you call a fish with no eyes? Fsh.",
  "I tried to sue the airline for losing my luggage. I lost my case.",
  "Why did the bicycle stand up by itself? It was two tired.",
  "I told my computer I needed a break, and it said ‘Why don’t you take a byte?’",
  "Why can’t your nose be 12 inches long? Because then it would be a foot.",
  "I’m on a seafood diet. I see food and I eat it.",
  "What do you call a fake noodle? An impasta.",
  "Why did the stadium get hot after the game? All of the fans left.",
  "Why do seagulls fly over the sea? Because if they flew over the bay, they’d be bagels.",
  "What do you call a snowman with a six-pack? An abdominal snowman.",
  "I gave all my dead batteries away today… free of charge.",
  "Why did the music teacher need a ladder? To reach the high notes.",
  "What’s orange and sounds like a parrot? A carrot.",
  "Why don’t elephants use computers? They’re afraid of the mouse.",
  "Why was the broom late? It swept in.",
  "What do you call a cow with no legs? Ground beef.",
  "Why did the cookie go to the hospital? Because it felt crumby.",
  "Why don’t ghosts go out in the rain? It dampens their spirits.",
  "I used to work in a shoe recycling shop. It was sole destroying.",
  "Why did the banana split? Because it saw the ice cream sundaes.",
  "What do you call a pig that does karate? A pork chop.",
  "I’m so good at sleeping I can do it with my eyes closed.",
  "How do you make holy water? You boil the hell out of it.",
  "Why did the computer show up at work late? It had a hard drive.",
  "Why did the scarecrow win an award? Because he was outstanding in his field.",
  "I stayed up all night to see where the sun went. Then it dawned on me.",
  "Why don’t mathematicians argue with logs? Because they always talk in natural language.",
  "Did you hear about the fire at the circus? It was in tents.",
  "What did the grape do when he got stepped on? Nothing, he just let out a little wine.",
  "Why did the chicken join a band? Because it had the drumsticks.",
  "I went to buy some camouflage trousers yesterday but couldn’t find any.",
  "Why did the barber win the race? He took a short cut.",
  "What do you call cheese that isn’t yours? Nacho cheese.",
  "Why did the scarecrow go to therapy? He felt stuffed.",
  "What happens to a frog’s car when it breaks down? It gets toad away.",
  "Why did the mushroom get invited to the party? Because he’s a fungi.",
  "What do you call an alligator in a vest? An investigator.",
  "Why did the student eat his homework? Because the teacher told him it was a piece of cake.",
  "I told my dog to play dead. Now he just sleeps all day.",
  "Why are teddy bears never hungry? Because they’re always stuffed.",
  "Why did the bicycle fall over? Because it was two tired.",
  "What did the ocean say to the beach? Nothing, it just waved.",
  "Why don’t programmers like nature? Too many bugs.",
  "I used to be a baker, but I couldn’t make enough dough.",
  "Why did the skeleton cross the road? To get to the body shop.",
  "Why did the computer get cold? It left its Windows open.",
  "I told a joke about UDP… but I’m not sure if anyone got it.",
  "Why did the scarecrow become a neurosurgeon? He was outstanding in his field and had a brain.",
  "Why did the duck get hired? Because he quacked all the right answers.",
  "What do you call a boomerang that doesn’t come back? A stick.",
  "Why did the soda go to school? It wanted to be pop‑ular.",
  "How do you catch a whole school of fish? With bookworms.",
  "Why did the tomato blush? Because it saw the salad dressing.",
  "I bought some shoes from a drug dealer. I don’t know what he laced them with, but I’ve been tripping all day.",
  "Why was the math book sad? Because it had too many problems.",
  "I once fell in love with a librarian… it was volume at first sight."
]
